ws/resources/objectRepo/xmlTemplates/MDM/HotelConfig/req_CreateRateClass.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateRateClassRQ>
         <v9:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v9:OperaContext>
         <v9:RateClass HotelCode="?" RateClass="?">
            <v91:Description/>
            <v91:Sequence/>
            <v91:TimeSpan>
               <v91:StartDate/>
               <v91:EndDate/>
               <v91:Duration/>
            </v91:TimeSpan>
            <v91:RateCategories>
               <v91:RateCategory Code="?" Description="?"/>
            </v91:RateCategories>
         </v9:RateClass>
      </v9:CreateRateClassRQ>
   </soapenv:Body>
</soapenv:Envelope>